# SectionArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..SectionArea Property
SpecTypeId Class See Also
---
Section Area, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SectionArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SectionArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SectionArea {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace